cfg/Catalogs/НалоговыеНазначенияАктивовИЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НалоговыеНазначенияАктивовИЗатрат</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалоговойДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Амортизируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНалоговогоНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНалоговыхНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Enums/ВидыДеятельностиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДеятельностиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Облагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необлагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОблагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОблагаемая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/НалоговыеНазначенияАктивовИЗатрат/Forms/ФормаНастройкиИспользуемых/Ext/Form/Module.bsl
Функция ОпределитьИспользуетсяЛиВНД(ВидНалоговойДеятельности, УчитыватьНеоблагаемыйВидДеятельностиНДС)

	ЕстьНеИспользуется = Ложь;
	Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если (НЕ УчитыватьНеоблагаемыйВидДеятельностиНДС) И (Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая) Тогда
			Продолжить;
			// не проверяем эти элементы
		КонецЕсли; 
		Если Выборка.ВидНалоговойДеятельности = ВидНалоговойДеятельности Тогда
			Если НЕ Выборка.Используется Тогда
				ЕстьНеИспользуется = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ ЕстьНеИспользуется;
	
КонецФункции // ОпределитьИспользуетсяЛиВНД()

Функция ОпределитьИспользуетсяЛиВидДеятельностиНДС(ВидДеятельностиНДС)

	ЕстьНеИспользуется = Ложь;
	Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДеятельностиНДС = ВидДеятельностиНДС Тогда
			Если НЕ Выборка.Используется Тогда
				ЕстьНеИспользуется = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ ЕстьНеИспользуется;
	
КонецФункции // ОпределитьИспользуетсяЛиВидДеятельностиНДС()
 

Процедура ПриОткрытии()
	
	ИспользоватьНеоблагаемыйВидДеятельностиНДС = ОпределитьИспользуетсяЛиВидДеятельностиНДС(Перечисления.ВидыДеятельностиНДС.Необлагаемая);

	Выборка = Справочники.ВидыНалоговойДеятельности.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Справочники.ВидыНалоговойДеятельности.ОблагаемаяПоОбычнойСтавке 
			ИЛИ Выборка.Ссылка = Справочники.ВидыНалоговойДеятельности.НеОблагаемая Тогда
			// используются всегда
			Продолжить;
		КонецЕсли; 
		
		Строка = ТаблицаВНД.Добавить();
		Строка.ВидНалоговойДеятельности = Выборка.Ссылка;
		Строка.Используется  = ОпределитьИспользуетсяЛиВНД(Строка.ВидНалоговойДеятельности, ИспользоватьНеоблагаемыйВидДеятельностиНДС);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Для каждого Строка Из ТаблицаВНД Цикл
		Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидНалоговойДеятельности = Строка.ВидНалоговойДеятельности Тогда
				ФлагИспользуется = Строка.Используется И (?(Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая,ИспользоватьНеоблагаемыйВидДеятельностиНДС,Истина));
				Если НЕ Выборка.Используется = ФлагИспользуется Тогда
					Объект = Выборка.ПолучитьОбъект();
					Объект.Используется = ФлагИспользуется;
					Объект.Записать();
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла;
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры
